# LeaderCount Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TextNote..::..LeaderCount Property
TextNote Class See Also
---
Number of leader objects currently attached to the text note.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public int LeaderCount { get; }
```

Visual Basic
---
```text
Public ReadOnly Property LeaderCount As Integer
	Get
```

Visual C++
---
```text
public:
property int LeaderCount {
	int get ();
}
```

# See Also
TextNote Class
Autodesk.Revit.DB Namespace